Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1064das176.h
extern volatile __CNFAbits_t CNFAbits __asm__ ("CNFA") __attribute__((section("sfrs"), address(0xBF8600B0)));
extern volatile uint32_t        CNFACLR __attribute__((section("sfrs"),address(0xBF8600B4)));
extern volatile uint32_t        CNFASET __attribute__((section("sfrs"),address(0xBF8600B8)));
extern volatile uint32_t        CNFAINV __attribute__((section("sfrs"),address(0xBF8600BC)));
#define SRCON0A SRCON0A
extern volatile uint32_t   SRCON0A __attribute__((section("sfrs"), address(0xBF8600C0)));
typedef struct {
  uint32_t :6;
  uint32_t SR0A6:1;
  uint32_t SR0A7:1;
} __SRCON0Abits_t;
extern volatile __SRCON0Abits_t SRCON0Abits __asm__ ("SRCON0A") __attribute__((section("sfrs"), address(0xBF8600C0)));
extern volatile uint32_t        SRCON0ACLR __attribute__((section("sfrs"),address(0xBF8600C4)));
extern volatile uint32_t        SRCON0ASET __attribute__((section("sfrs"),address(0xBF8600C8)));
extern volatile uint32_t        SRCON0AINV __attribute__((section("sfrs"),address(0xBF8600CC)));
#define SRCON1A SRCON1A
extern volatile uint32_t   SRCON1A __attribute__((section("sfrs"), address(0xBF8600D0)));
typedef struct {
  uint32_t :6;
  uint32_t SR1A6:1;
  uint32_t SR1A7:1;
} __SRCON1Abits_t;
extern volatile __SRCON1Abits_t SRCON1Abits __asm__ ("SRCON1A") __attribute__((section("sfrs"), address(0xBF8600D0)));
extern volatile uint32_t        SRCON1ACLR __attribute__((section("sfrs"),address(0xBF8600D4)));
extern volatile uint32_t        SRCON1ASET __attribute__((section("sfrs"),address(0xBF8600D8)));
extern volatile uint32_t        SRCON1AINV __attribute__((section("sfrs"),address(0xBF8600DC)));
#define ANSELB ANSELB
extern volatile uint32_t   ANSELB __attribute__((section("sfrs"), address(0xBF860100)));
typedef union {
  struct {
    uint32_t ANSB0:1;
    uint32_t ANSB1:1;
    uint32_t ANSB2:1;
    uint32_t ANSB3:1;
    uint32_t ANSB4:1;
    uint32_t ANSB5:1;
    uint32_t :1;
    uint32_t ANSB7:1;
    uint32_t ANSB8:1;
    uint32_t ANSB9:1;
    uint32_t ANSB10:1;
    uint32_t ANSB11:1;
    uint32_t ANSB12:1;
    uint32_t ANSB13:1;
    uint32_t ANSB14:1;
    uint32_t ANSB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELBbits_t;
extern volatile __ANSELBbits_t ANSELBbits __asm__ ("ANSELB") __attribute__((section("sfrs"), address(0xBF860100)));
extern volatile uint32_t        ANSELBCLR __attribute__((section("sfrs"),address(0xBF860104)));
extern volatile uint32_t        ANSELBSET __attribute__((section("sfrs"),address(0xBF860108)));
extern volatile uint32_t        ANSELBINV __attribute__((section("sfrs"),address(0xBF86010C)));
#define TRISB TRISB
extern volatile uint32_t   TRISB __attribute__((section("sfrs"), address(0xBF860110)));
typedef union {
  struct {
    uint32_t TRISB0:1;
    uint32_t TRISB1:1;
    uint32_t TRISB2:1;
    uint32_t TRISB3:1;
    uint32_t TRISB4:1;
    uint32_t TRISB5:1;
    uint32_t TRISB6:1;
    uint32_t TRISB7:1;
    uint32_t TRISB8:1;
    uint32_t TRISB9:1;
    uint32_t TRISB10:1;
    uint32_t TRISB11:1;
    uint32_t TRISB12:1;
    uint32_t TRISB13:1;
    uint32_t TRISB14:1;
    uint32_t TRISB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __TRISBbits_t;
extern volatile __TRISBbits_t TRISBbits __asm__ ("TRISB") __attribute__((section("sfrs"), address(0xBF860110)));
extern volatile uint32_t        TRISBCLR __attribute__((section("sfrs"),address(0xBF860114)));
extern volatile uint32_t        TRISBSET __attribute__((section("sfrs"),address(0xBF860118)));
extern volatile uint32_t        TRISBINV __attribute__((section("sfrs"),address(0xBF86011C)));
#define PORTB PORTB
extern volatile uint32_t   PORTB __attribute__((section("sfrs"), address(0xBF860120)));
typedef union {
  struct {
    uint32_t RB0:1;
    uint32_t RB1:1;
    uint32_t RB2:1;
    uint32_t RB3:1;
    uint32_t RB4:1;
    uint32_t RB5:1;
    uint32_t RB6:1;
    uint32_t RB7:1;
    uint32_t RB8:1;
    uint32_t RB9:1;
    uint32_t RB10:1;
    uint32_t RB11:1;
    uint32_t RB12:1;
    uint32_t RB13:1;
    uint32_t RB14:1;
    uint32_t RB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __PORTBbits_t;
extern volatile __PORTBbits_t PORTBbits __asm__ ("PORTB") __attribute__((section("sfrs"), address(0xBF860120)));
extern volatile uint32_t        PORTBCLR __attribute__((section("sfrs"),address(0xBF860124)));
extern volatile uint32_t        PORTBSET __attribute__((section("sfrs"),address(0xBF860128)));
extern volatile uint32_t        PORTBINV __attribute__((section("sfrs"),address(0xBF86012C)));
#define LATB LATB
extern volatile uint32_t   LATB __attribute__((section("sfrs"), address(0xBF860130)));
typedef union {
  struct {
    uint32_t LATB0:1;
    uint32_t LATB1:1;
    uint32_t LATB2:1;
    uint32_t LATB3:1;
    uint32_t LATB4:1;
    uint32_t LATB5:1;
    uint32_t LATB6:1;
    uint32_t LATB7:1;
    uint32_t LATB8:1;
    uint32_t LATB9:1;
    uint32_t LATB10:1;
    uint32_t LATB11:1;
    uint32_t LATB12:1;
    uint32_t LATB13:1;
    uint32_t LATB14:1;
    uint32_t LATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __LATBbits_t;
extern volatile __LATBbits_t LATBbits __asm__ ("LATB") __attribute__((section("sfrs"), address(0xBF860130)));
extern volatile uint32_t        LATBCLR __attribute__((section("sfrs"),address(0xBF860134)));
extern volatile uint32_t        LATBSET __attribute__((section("sfrs"),address(0xBF860138)));
extern volatile uint32_t        LATBINV __attribute__((section("sfrs"),address(0xBF86013C)));
#define ODCB ODCB
extern volatile uint32_t   ODCB __attribute__((section("sfrs"), address(0xBF860140)));
typedef union {
  struct {
    uint32_t ODCB0:1;
    uint32_t ODCB1:1;
    uint32_t ODCB2:1;
    uint32_t ODCB3:1;
    uint32_t ODCB4:1;
    uint32_t ODCB5:1;
    uint32_t ODCB6:1;
    uint32_t ODCB7:1;
    uint32_t ODCB8:1;
    uint32_t ODCB9:1;
    uint32_t ODCB10:1;
    uint32_t ODCB11:1;
    uint32_t ODCB12:1;
    uint32_t ODCB13:1;
    uint32_t ODCB14:1;
    uint32_t ODCB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCBbits_t;
extern volatile __ODCBbits_t ODCBbits __asm__ ("ODCB") __attribute__((section("sfrs"), address(0xBF860140)));
extern volatile uint32_t        ODCBCLR __attribute__((section("sfrs"),address(0xBF860144)));
extern volatile uint32_t        ODCBSET __attribute__((section("sfrs"),address(0xBF860148)));
extern volatile uint32_t        ODCBINV __attribute__((section("sfrs"),address(0xBF86014C)));
#define CNPUB CNPUB
extern volatile uint32_t   CNPUB __attribute__((section("sfrs"), address(0xBF860150)));
typedef union {
  struct {
    uint32_t CNPUB0:1;
    uint32_t CNPUB1:1;
    uint32_t CNPUB2:1;
    uint32_t CNPUB3:1;
    uint32_t CNPUB4:1;
    uint32_t CNPUB5:1;
    uint32_t CNPUB6:1;
    uint32_t CNPUB7:1;
    uint32_t CNPUB8:1;
    uint32_t CNPUB9:1;
    uint32_t CNPUB10:1;
    uint32_t CNPUB11:1;
    uint32_t CNPUB12:1;
    uint32_t CNPUB13:1;
    uint32_t CNPUB14:1;
    uint32_t CNPUB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUBbits_t;
extern volatile __CNPUBbits_t CNPUBbits __asm__ ("CNPUB") __attribute__((section("sfrs"), address(0xBF860150)));
extern volatile uint32_t        CNPUBCLR __attribute__((section("sfrs"),address(0xBF860154)));
extern volatile uint32_t        CNPUBSET __attribute__((section("sfrs"),address(0xBF860158)));
extern volatile uint32_t        CNPUBINV __attribute__((section("sfrs"),address(0xBF86015C)));
#define CNPDB CNPDB
extern volatile uint32_t   CNPDB __attribute__((section("sfrs"), address(0xBF860160)));
typedef union {
  struct {
    uint32_t CNPDB0:1;
    uint32_t CNPDB1:1;
    uint32_t CNPDB2:1;
    uint32_t CNPDB3:1;
    uint32_t CNPDB4:1;
    uint32_t CNPDB5:1;
    uint32_t CNPDB6:1;
    uint32_t CNPDB7:1;
    uint32_t CNPDB8:1;
    uint32_t CNPDB9:1;
    uint32_t CNPDB10:1;
    uint32_t CNPDB11:1;
    uint32_t CNPDB12:1;
    uint32_t CNPDB13:1;
    uint32_t CNPDB14:1;
    uint32_t CNPDB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDBbits_t;
extern volatile __CNPDBbits_t CNPDBbits __asm__ ("CNPDB") __attribute__((section("sfrs"), address(0xBF860160)));
extern volatile uint32_t        CNPDBCLR __attribute__((section("sfrs"),address(0xBF860164)));
extern volatile uint32_t        CNPDBSET __attribute__((section("sfrs"),address(0xBF860168)));
extern volatile uint32_t        CNPDBINV __attribute__((section("sfrs"),address(0xBF86016C)));
#define CNCONB CNCONB
extern volatile uint32_t   CNCONB __attribute__((section("sfrs"), address(0xBF860170)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONBbits_t;
extern volatile __CNCONBbits_t CNCONBbits __asm__ ("CNCONB") __attribute__((section("sfrs"), address(0xBF860170)));
extern volatile uint32_t        CNCONBCLR __attribute__((section("sfrs"),address(0xBF860174)));
extern volatile uint32_t        CNCONBSET __attribute__((section("sfrs"),address(0xBF860178)));
extern volatile uint32_t        CNCONBINV __attribute__((section("sfrs"),address(0xBF86017C)));
#define CNENB CNENB
extern volatile uint32_t   CNENB __attribute__((section("sfrs"), address(0xBF860180)));
typedef union {
  struct {
    uint32_t CNIEB0:1;
    uint32_t CNIEB1:1;
    uint32_t CNIEB2:1;
    uint32_t CNIEB3:1;
    uint32_t CNIEB4:1;
    uint32_t CNIEB5:1;
    uint32_t CNIEB6:1;
    uint32_t CNIEB7:1;
    uint32_t CNIEB8:1;
    uint32_t CNIEB9:1;
    uint32_t CNIEB10:1;
    uint32_t CNIEB11:1;
    uint32_t CNIEB12:1;
    uint32_t CNIEB13:1;
    uint32_t CNIEB14:1;
    uint32_t CNIEB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENBbits_t;
extern volatile __CNENBbits_t CNENBbits __asm__ ("CNENB") __attribute__((section("sfrs"), address(0xBF860180)));
extern volatile uint32_t        CNENBCLR __attribute__((section("sfrs"),address(0xBF860184)));
extern volatile uint32_t        CNENBSET __attribute__((section("sfrs"),address(0xBF860188)));
extern volatile uint32_t        CNENBINV __attribute__((section("sfrs"),address(0xBF86018C)));
#define CNSTATB CNSTATB
extern volatile uint32_t   CNSTATB __attribute__((section("sfrs"), address(0xBF860190)));
typedef union {
  struct {
    uint32_t CNSTATB0:1;
    uint32_t CNSTATB1:1;
    uint32_t CNSTATB2:1;
    uint32_t CNSTATB3:1;
    uint32_t CNSTATB4:1;
    uint32_t CNSTATB5:1;
    uint32_t CNSTATB6:1;
    uint32_t CNSTATB7:1;
    uint32_t CNSTATB8:1;
    uint32_t CNSTATB9:1;
    uint32_t CNSTATB10:1;
    uint32_t CNSTATB11:1;
    uint32_t CNSTATB12:1;
    uint32_t CNSTATB13:1;
    uint32_t CNSTATB14:1;
    uint32_t CNSTATB15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATBbits_t;
extern volatile __CNSTATBbits_t CNSTATBbits __asm__ ("CNSTATB") __attribute__((section("sfrs"), address(0xBF860190)));
extern volatile uint32_t        CNSTATBCLR __attribute__((section("sfrs"),address(0xBF860194)));
extern volatile uint32_t        CNSTATBSET __attribute__((section("sfrs"),address(0xBF860198)));
extern volatile uint32_t        CNSTATBINV __attribute__((section("sfrs"),address(0xBF86019C)));
#define CNNEB CNNEB
extern volatile uint32_t   CNNEB __attribute__((section("sfrs"), address(0xBF8601A0)));
typedef struct {
  uint32_t CNNEB0:1;
  uint32_t CNNEB1:1;
  uint32_t CNNEB2:1;
  uint32_t CNNEB3:1;
  uint32_t CNNEB4:1;
  uint32_t CNNEB5:1;
  uint32_t CNNEB6:1;
  uint32_t CNNEB7:1;
  uint32_t CNNEB8:1;
  uint32_t CNNEB9:1;
  uint32_t CNNEB10:1;
  uint32_t CNNEB11:1;
  uint32_t CNNEB12:1;
  uint32_t CNNEB13:1;
  uint32_t CNNEB14:1;
  uint32_t CNNEB15:1;
} __CNNEBbits_t;
extern volatile __CNNEBbits_t CNNEBbits __asm__ ("CNNEB") __attribute__((section("sfrs"), address(0xBF8601A0)));
extern volatile uint32_t        CNNEBCLR __attribute__((section("sfrs"),address(0xBF8601A4)));
extern volatile uint32_t        CNNEBSET __attribute__((section("sfrs"),address(0xBF8601A8)));
extern volatile uint32_t        CNNEBINV __attribute__((section("sfrs"),address(0xBF8601AC)));
#define CNFB CNFB
extern volatile uint32_t   CNFB __attribute__((section("sfrs"), address(0xBF8601B0)));
typedef struct {
  uint32_t CNFB0:1;
  uint32_t CNFB1:1;
  uint32_t CNFB2:1;
  uint32_t CNFB3:1;
  uint32_t CNFB4:1;
  uint32_t CNFB5:1;
  uint32_t CNFB6:1;
  uint32_t CNFB7:1;
  uint32_t CNFB8:1;
  uint32_t CNFB9:1;
  uint32_t CNFB10:1;
  uint32_t CNFB11:1;
  uint32_t CNFB12:1;
  uint32_t CNFB13:1;
  uint32_t CNFB14:1;
  uint32_t CNFB15:1;
} __CNFBbits_t;
extern volatile __CNFBbits_t CNFBbits __asm__ ("CNFB") __attribute__((section("sfrs"), address(0xBF8601B0)));
extern volatile uint32_t        CNFBCLR __attribute__((section("sfrs"),address(0xBF8601B4)));
extern volatile uint32_t        CNFBSET __attribute__((section("sfrs"),address(0xBF8601B8)));
extern volatile uint32_t        CNFBINV __attribute__((section("sfrs"),address(0xBF8601BC)));
#define SRCON0B SRCON0B
extern volatile uint32_t   SRCON0B __attribute__((section("sfrs"), address(0xBF8601C0)));
typedef struct {
  uint32_t SR0B0:1;
  uint32_t SR0B1:1;
  uint32_t SR0B2:1;
  uint32_t SR0B3:1;
  uint32_t SR0B4:1;
  uint32_t SR0B5:1;
  uint32_t SR0B6:1;
  uint32_t SR0B7:1;
  uint32_t SR0B8:1;
  uint32_t SR0B9:1;
  uint32_t SR0B10:1;
  uint32_t SR0B11:1;
  uint32_t SR0B12:1;
  uint32_t SR0B13:1;
  uint32_t SR0B14:1;
  uint32_t SR0B15:1;
} __SRCON0Bbits_t;
extern volatile __SRCON0Bbits_t SRCON0Bbits __asm__ ("SRCON0B") __attribute__((section("sfrs"), address(0xBF8601C0)));
extern volatile uint32_t        SRCON0BCLR __attribute__((section("sfrs"),address(0xBF8601C4)));
extern volatile uint32_t        SRCON0BSET __attribute__((section("sfrs"),address(0xBF8601C8)));
extern volatile uint32_t        SRCON0BINV __attribute__((section("sfrs"),address(0xBF8601CC)));
#define SRCON1B SRCON1B
extern volatile uint32_t   SRCON1B __attribute__((section("sfrs"), address(0xBF8601D0)));
typedef struct {
  uint32_t SR1B0:1;
  uint32_t SR1B1:1;
  uint32_t SR1B2:1;
  uint32_t SR1B3:1;
  uint32_t SR1B4:1;
  uint32_t SR1B5:1;
  uint32_t SR1B6:1;
  uint32_t SR1B7:1;
  uint32_t SR1B8:1;
  uint32_t SR1B9:1;
  uint32_t SR1B10:1;
  uint32_t SR1B11:1;
  uint32_t SR1B12:1;
  uint32_t SR1B13:1;
  uint32_t SR1B14:1;
  uint32_t SR1B15:1;
} __SRCON1Bbits_t;
extern volatile __SRCON1Bbits_t SRCON1Bbits __asm__ ("SRCON1B") __attribute__((section("sfrs"), address(0xBF8601D0)));
extern volatile uint32_t        SRCON1BCLR __attribute__((section("sfrs"),address(0xBF8601D4)));
extern volatile uint32_t        SRCON1BSET __attribute__((section("sfrs"),address(0xBF8601D8)));
extern volatile uint32_t        SRCON1BINV __attribute__((section("sfrs"),address(0xBF8601DC)));
#define ANSELC ANSELC
extern volatile uint32_t   ANSELC __attribute__((section("sfrs"), address(0xBF860200)));
typedef union {
  struct {
    uint32_t :1;
    uint32_t ANSC1:1;
    uint32_t ANSC2:1;
    uint32_t ANSC3:1;
    uint32_t ANSC4:1;
  };
  struct {
    uint32_t w:32;
  };
} __ANSELCbits_t;
