Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.3.111/include/proc/p32mz1064das176.h
extern volatile __C1RXF20bits_t C1RXF20bits __asm__ ("C1RXF20") __attribute__((section("sfrs"), address(0xBF880280)));
extern volatile uint32_t        C1RXF20CLR __attribute__((section("sfrs"),address(0xBF880284)));
extern volatile uint32_t        C1RXF20SET __attribute__((section("sfrs"),address(0xBF880288)));
extern volatile uint32_t        C1RXF20INV __attribute__((section("sfrs"),address(0xBF88028C)));
#define C1RXF21 C1RXF21
extern volatile uint32_t   C1RXF21 __attribute__((section("sfrs"), address(0xBF880290)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF21bits_t;
extern volatile __C1RXF21bits_t C1RXF21bits __asm__ ("C1RXF21") __attribute__((section("sfrs"), address(0xBF880290)));
extern volatile uint32_t        C1RXF21CLR __attribute__((section("sfrs"),address(0xBF880294)));
extern volatile uint32_t        C1RXF21SET __attribute__((section("sfrs"),address(0xBF880298)));
extern volatile uint32_t        C1RXF21INV __attribute__((section("sfrs"),address(0xBF88029C)));
#define C1RXF22 C1RXF22
extern volatile uint32_t   C1RXF22 __attribute__((section("sfrs"), address(0xBF8802A0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF22bits_t;
extern volatile __C1RXF22bits_t C1RXF22bits __asm__ ("C1RXF22") __attribute__((section("sfrs"), address(0xBF8802A0)));
extern volatile uint32_t        C1RXF22CLR __attribute__((section("sfrs"),address(0xBF8802A4)));
extern volatile uint32_t        C1RXF22SET __attribute__((section("sfrs"),address(0xBF8802A8)));
extern volatile uint32_t        C1RXF22INV __attribute__((section("sfrs"),address(0xBF8802AC)));
#define C1RXF23 C1RXF23
extern volatile uint32_t   C1RXF23 __attribute__((section("sfrs"), address(0xBF8802B0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF23bits_t;
extern volatile __C1RXF23bits_t C1RXF23bits __asm__ ("C1RXF23") __attribute__((section("sfrs"), address(0xBF8802B0)));
extern volatile uint32_t        C1RXF23CLR __attribute__((section("sfrs"),address(0xBF8802B4)));
extern volatile uint32_t        C1RXF23SET __attribute__((section("sfrs"),address(0xBF8802B8)));
extern volatile uint32_t        C1RXF23INV __attribute__((section("sfrs"),address(0xBF8802BC)));
#define C1RXF24 C1RXF24
extern volatile uint32_t   C1RXF24 __attribute__((section("sfrs"), address(0xBF8802C0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF24bits_t;
extern volatile __C1RXF24bits_t C1RXF24bits __asm__ ("C1RXF24") __attribute__((section("sfrs"), address(0xBF8802C0)));
extern volatile uint32_t        C1RXF24CLR __attribute__((section("sfrs"),address(0xBF8802C4)));
extern volatile uint32_t        C1RXF24SET __attribute__((section("sfrs"),address(0xBF8802C8)));
extern volatile uint32_t        C1RXF24INV __attribute__((section("sfrs"),address(0xBF8802CC)));
#define C1RXF25 C1RXF25
extern volatile uint32_t   C1RXF25 __attribute__((section("sfrs"), address(0xBF8802D0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF25bits_t;
extern volatile __C1RXF25bits_t C1RXF25bits __asm__ ("C1RXF25") __attribute__((section("sfrs"), address(0xBF8802D0)));
extern volatile uint32_t        C1RXF25CLR __attribute__((section("sfrs"),address(0xBF8802D4)));
extern volatile uint32_t        C1RXF25SET __attribute__((section("sfrs"),address(0xBF8802D8)));
extern volatile uint32_t        C1RXF25INV __attribute__((section("sfrs"),address(0xBF8802DC)));
#define C1RXF26 C1RXF26
extern volatile uint32_t   C1RXF26 __attribute__((section("sfrs"), address(0xBF8802E0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF26bits_t;
extern volatile __C1RXF26bits_t C1RXF26bits __asm__ ("C1RXF26") __attribute__((section("sfrs"), address(0xBF8802E0)));
extern volatile uint32_t        C1RXF26CLR __attribute__((section("sfrs"),address(0xBF8802E4)));
extern volatile uint32_t        C1RXF26SET __attribute__((section("sfrs"),address(0xBF8802E8)));
extern volatile uint32_t        C1RXF26INV __attribute__((section("sfrs"),address(0xBF8802EC)));
#define C1RXF27 C1RXF27
extern volatile uint32_t   C1RXF27 __attribute__((section("sfrs"), address(0xBF8802F0)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF27bits_t;
extern volatile __C1RXF27bits_t C1RXF27bits __asm__ ("C1RXF27") __attribute__((section("sfrs"), address(0xBF8802F0)));
extern volatile uint32_t        C1RXF27CLR __attribute__((section("sfrs"),address(0xBF8802F4)));
extern volatile uint32_t        C1RXF27SET __attribute__((section("sfrs"),address(0xBF8802F8)));
extern volatile uint32_t        C1RXF27INV __attribute__((section("sfrs"),address(0xBF8802FC)));
#define C1RXF28 C1RXF28
extern volatile uint32_t   C1RXF28 __attribute__((section("sfrs"), address(0xBF880300)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF28bits_t;
extern volatile __C1RXF28bits_t C1RXF28bits __asm__ ("C1RXF28") __attribute__((section("sfrs"), address(0xBF880300)));
extern volatile uint32_t        C1RXF28CLR __attribute__((section("sfrs"),address(0xBF880304)));
extern volatile uint32_t        C1RXF28SET __attribute__((section("sfrs"),address(0xBF880308)));
extern volatile uint32_t        C1RXF28INV __attribute__((section("sfrs"),address(0xBF88030C)));
#define C1RXF29 C1RXF29
extern volatile uint32_t   C1RXF29 __attribute__((section("sfrs"), address(0xBF880310)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF29bits_t;
extern volatile __C1RXF29bits_t C1RXF29bits __asm__ ("C1RXF29") __attribute__((section("sfrs"), address(0xBF880310)));
extern volatile uint32_t        C1RXF29CLR __attribute__((section("sfrs"),address(0xBF880314)));
extern volatile uint32_t        C1RXF29SET __attribute__((section("sfrs"),address(0xBF880318)));
extern volatile uint32_t        C1RXF29INV __attribute__((section("sfrs"),address(0xBF88031C)));
#define C1RXF30 C1RXF30
extern volatile uint32_t   C1RXF30 __attribute__((section("sfrs"), address(0xBF880320)));
typedef union {
  struct {
    uint32_t EID:18;
    uint32_t :1;
    uint32_t EXID:1;
    uint32_t :1;
    uint32_t SID:11;
  };
  struct {
    uint32_t w:32;
  };
} __C1RXF30bits_t;
